; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	instrument2 - instrument
	satellite1 - satellite
	instrument3 - instrument
	instrument4 - instrument
	instrument5 - instrument
	satellite2 - satellite
	instrument6 - instrument
	instrument7 - instrument
	image0 - mode
	image4 - mode
	infrared1 - mode
	image2 - mode
	image3 - mode
	Star0 - direction
	Star4 - direction
	GroundStation1 - direction
	GroundStation5 - direction
	Star2 - direction
	GroundStation3 - direction
	Planet6 - direction
	Star7 - direction
	Planet8 - direction
	Planet9 - direction
	Star10 - direction
)
(:init
	(supports instrument0 image0)
	(supports instrument0 image4)
	(supports instrument0 image3)
	(calibration_target instrument0 GroundStation3)
	(calibration_target instrument0 Star2)
	(supports instrument1 infrared1)
	(supports instrument1 image0)
	(calibration_target instrument1 Star2)
	(calibration_target instrument1 Star4)
	(supports instrument2 image0)
	(calibration_target instrument2 GroundStation5)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(on_board instrument2 satellite0)
	(power_avail satellite0)
	(pointing satellite0 GroundStation5)
	(supports instrument3 image2)
	(supports instrument3 image0)
	(calibration_target instrument3 Star0)
	(calibration_target instrument3 GroundStation3)
	(supports instrument4 image0)
	(supports instrument4 image4)
	(supports instrument4 infrared1)
	(calibration_target instrument4 Star4)
	(supports instrument5 image4)
	(supports instrument5 infrared1)
	(supports instrument5 image0)
	(calibration_target instrument5 GroundStation5)
	(calibration_target instrument5 GroundStation1)
	(on_board instrument3 satellite1)
	(on_board instrument4 satellite1)
	(on_board instrument5 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Star0)
	(supports instrument6 image3)
	(supports instrument6 image0)
	(calibration_target instrument6 Star2)
	(supports instrument7 image0)
	(supports instrument7 image4)
	(calibration_target instrument7 GroundStation3)
	(on_board instrument6 satellite2)
	(on_board instrument7 satellite2)
	(power_avail satellite2)
	(pointing satellite2 GroundStation3)
)
(:goal (and
	(pointing satellite2 Planet9)
	(have_image Planet6 infrared1)
	(have_image Star7 image2)
	(have_image Planet8 image0)
	(have_image Planet9 image3)
	(have_image Star10 infrared1)
))

)

; plan
1. (turn_to satellite2 star2 groundstation3)
   deleted: (pointing satellite2 groundstation3)
   added: (pointing satellite2 star2)
   goals met: 0 of 6
2. (turn_to satellite0 star2 groundstation5)
   deleted: (pointing satellite0 groundstation5)
   added: (pointing satellite0 star2)
   goals met: 0 of 6
3. (switch_on instrument6 satellite2)
   deleted: (power_avail satellite2)
   added: (power_on instrument6)
   goals met: 0 of 6
4. (switch_on instrument3 satellite1)
   deleted: (power_avail satellite1)
   added: (power_on instrument3)
   goals met: 0 of 6
5. (switch_on instrument1 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument1)
   goals met: 0 of 6
6. (calibrate satellite2 instrument6 star2)
   added: (calibrated instrument6)
   goals met: 0 of 6
7. (calibrate satellite1 instrument3 star0)
   added: (calibrated instrument3)
   goals met: 0 of 6
8. (calibrate satellite0 instrument1 star2)
   added: (calibrated instrument1)
   goals met: 0 of 6
9. (turn_to satellite0 planet6 star2)
   deleted: (pointing satellite0 star2)
   added: (pointing satellite0 planet6)
   goals met: 0 of 6
10. (take_image satellite0 planet6 instrument1 infrared1)
   added: (have_image planet6 infrared1)
   goals met: 1 of 6
11. (turn_to satellite0 planet8 planet6)
   deleted: (pointing satellite0 planet6)
   added: (pointing satellite0 planet8)
   goals met: 1 of 6
12. (take_image satellite0 planet8 instrument1 image0)
   added: (have_image planet8 image0)
   goals met: 2 of 6
13. (turn_to satellite0 star10 planet8)
   deleted: (pointing satellite0 planet8)
   added: (pointing satellite0 star10)
   goals met: 2 of 6
14. (take_image satellite0 star10 instrument1 infrared1)
   added: (have_image star10 infrared1)
   goals met: 3 of 6
15. (turn_to satellite1 star7 star0)
   deleted: (pointing satellite1 star0)
   added: (pointing satellite1 star7)
   goals met: 3 of 6
16. (take_image satellite1 star7 instrument3 image2)
   added: (have_image star7 image2)
   goals met: 4 of 6
17. (turn_to satellite2 planet9 star2)
   deleted: (pointing satellite2 star2)
   added: (pointing satellite2 planet9)
   goals met: 5 of 6
18. (take_image satellite2 planet9 instrument6 image3)
   added: (have_image planet9 image3)
   goals met: 6 of 6
